package animal;

public class AnimalMain {
    // создать класс Animal  с полями name , weight, colour  и вывести на экран
    // списки животных упорядоченные 1. по имени,2. по весу  3. список названий
    // животных, упорядоченный по возрастанию последней буквы названия.
    // Использовать компараторы
    //name
    // Bear 500, brown
    //Wolf, 100,grey

    //weight
    //Wolf, 100,grey
    // Bear 500, brown

    //Wolf
    // Bear

    //_________________________________________
    //2.Есть класс Employee  с полями  id, name, age, salary.
    // Сделать его comparable по id
    // сделать дополнительные возможности сортировки по: salary, age, name,
    // ageAndThenName если возраст одинаковый то по имени.
    // Создать лист таких сотрудников и вывести его на э
    // кран отсортированный всеми способами
    //Collections.sort

}
