public class Main {

    public static void main(String[] args) {
        // 1.создать классы,
        //содержащие методы для подсчета площади и периметра rectangle and circle,
        //используя интерфейсы. Создать несколько обьектов этих типов и вывести  на экран
        //их площадь и периметр

        //2. написать программу, которая при вводе с клавиатуры дня недели отвечает
        // на вопрос является ли этот день выходным ( для выходного it is true , для рабочего it is false).
        // использовать класс Enum. Вам может понадобиться метод класса Enum  valueOf



    }
}
